import 'package:flutter/material.dart';
// import '../models/cantact.dart';
import 'submitScreen.dart';

class PaperScreen extends StatelessWidget {
  const PaperScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        title: const Text("กฎระเบียบ"),
        backgroundColor: Colors.orange[500],
      ),
      body: bodyPaper(),
    );
  }
}

class bodyPaper extends StatefulWidget {
  const bodyPaper({super.key});

  @override
  State<bodyPaper> createState() => _bodyPaperState();
}

class _bodyPaperState extends State<bodyPaper> {
  @override
  Widget build(BuildContext context) {
    // List<contact> contactList = [];
    return ListView(
      padding: const EdgeInsets.all(30.0),
      children: <Widget>[
        Text(
          "กฎระเบียบของบริษัท อโตมิคส์ จำกัด",
          style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
        ),
        const SizedBox(height: 10.0),
        Text(
          "1.สมาชิกต้องยึดมั่นในกฎระเบียบและข้อบังคับของบริษัทฯ อย่างเคร่งครัด",
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
        const SizedBox(height: 10),
        Text(
          "สมาชิกทุกคนต้องยึดมั่นในกฎระเบียบและข้อบังคับของบริษัทที่ ประกาศใช้อยู่แล้ว และ/หรือ ที่กำลังจะประกาศใช้ต่อไปหากสมาชิกละเมิดหรือฝ่าฝืนจะถูกเพิกถอนสถานะจากการเป็นสมาชิกของบริษัทฯ",
          style: TextStyle(fontSize: 16),
        ),
        const SizedBox(height: 10),
        Text(
          "2.สมาชิกต้องประพฤติตนให้เหมาะสมตามกฎระเบียบและ ข้อบังคับ และจะไม่ละเมิดต่อจรรยาบรรณ ดังนี้",
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
        const SizedBox(height: 10),
        Text(
          "1.ห้ามเปิดเผยรายได้ ลงสื่อสาธารณะ",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "2.ห้ามแก้ไขหรือบิดเบือนรายได้ ทางอิเล็กทรอนิกส์ โดยเด็ดขาด",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "3.ห้ามใช้สัญลักษณ์ ( โลโก้ )ของบริษัทอโตมิคส์ โดยไม่ได้รับอนุญาต",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "4.ห้ามใช้ชื่อบริษัท เป็นส่วนหนึ่งของชื่อ domain name",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "5.มีความซื่อสัตย์สุจริตต่อลูกค้าเพื่อนสมาชิกร่วมอาชีพและบริษัท",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "6.ไม่กล่าวร้ายทับถมเพื่อนร่วมอาชีพ เพื่อหวังให้เกิดความเข้าใจผิด ให้เกิดความไม่ไว้วางใจและให้เกิดความเสียหายแก่สมาชิกและ บริษัทฯ",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "7.ไม่ลดราคาสินค้าหรือเสนอที่จะลดราคาสินค้าเพื่อเป็นการจูงใจให้ซื้อสินค้า",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "8.ไม่แนะนำ หรือกระทำการใดๆที่ผิดต่อกฎระเบียบและข้อบังคับ",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "9.ไม่กล่าวอ้างสรรพคุณผลิตภัณฑ์สินค้าและผลตอบแทน แผนการตลาดเกินความเป็นจริง",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "10.หมั่นศึกษาหาความรู้ในวิชาชีพเพิ่มเติมให้ตนเองอยู่อย่าง สม่ำเสมอ",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "11.ประพฤติตนอยู่ในศีลธรรมอันดีงาม ทั้งต้องดำรงไว้ซึ่ง เกียรติ ศักดิ์ศรี และคุณธรรมแห่งวิชาชีพ",
          style: TextStyle(fontSize: 16),
        ),
        const SizedBox(
          height: 10,
        ),
        Text(
          "3.การได้มาซึ่งสถานภาพการเป็นสมาชิกด้วยการสมัครเป็นสมาชิกของบริษัทฯ",
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
        const SizedBox(height: 10),
        Text(
          "1.ผู้สมัครเป็นสมาชิกใหม่ของบริษัทฯ ต้องมีอายุไม่ต่ำกว่า 18 ปี บริบูรณ์ ณ วันที่สมัครเป็นสมาชิก",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "2.กรอกข้อมูลในการสมัครให้ถูกต้องครบถ้วนด้วยตนเอง โดยข้อมูลต่างๆ จะต้องเป็นความจริงและทำความเข้าใจ ตามข้อตกลงก่อนลงชื่อและต้องลงชื่อด้วยตนเองในการ สมัครซึ่งการสมัครสมาชิกก็ถือเป็นหนังสือสัญญาที่จะมี ภาระผูกพันหลังจากได้ผ่านการ พิจารณาอนุมัติจากบริษัทฯแล้ว",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "3.ผู้สมัครต้องแนบสำเนาบัตรประชาชนและสำเนาหน้าบัญชี ธนาคาร ทั้งสองอย่างให้บริษัทถึงจะถือว่าการสมัครนั้นสมบูรณ์",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "4.ผู้สมัครต้องไม่เคยมีชื่อในทะเบียนมาก่อน ผู้สมัครต้องสมัคร เป็นสมาชิกภายใต้สายงานของบุคคลที่แนะนำคนแรก หรือ บุคคลที่นำผู้สมัครมาที่บริษัทฯ เท่านั้น",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "5.บริษัทฯ จะไม่ดำเนินการใดๆ กับการสมัครที่ไม่สมบูรณ์ จนกว่าผู้สมัครจะได้ทำการแก้ไขเรียบร้อยบทบาทหน้าที่ของ สมาชิก",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "6.สมาชิกคือคู่สัญญาที่มีอิสระ ไม่ใช่ลูกจ้าง พนักงาน ตัวแทนจำหน่าย หรือตัวแทนของบริษัทฯสมาชิกคือ คู่สัญญาที่มีอิสระ ไม่ใช่ลูกจ้าง พนักงาน ตัวแทนจำหน่าย หรือตัวแทนของบริษัทฯ",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "7.สมาชิกต้องไม่แสดงตนว่ามีความสัมพันธ์เป็นส่วนหนึ่ง ของบริษัทฯ อันนอกเหนือจากการเป็นคู่สัญญาที่มีอิสระเท่านั้น",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "8.สมาชิกจะต้องไม่ทำการประชุม แถลงข่าว เรียกร้องสิทธิต่างๆ หรือเป็นตัวแทนผลิตภัณฑ์ชนิดอื่นๆ และจะไม่ชักชวนสมาชิก ในบริษัทฯเข้าร่วมกิจกรรมดังกล่าวด้วย",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "9.สมาชิกไม่มีสิทธิจะผูกมัดบริษัทฯ ในข้อผูกมัดใดๆ หรือเรียกร้องค่าเสียหายใดๆ หรือให้บริษัทฯชดใช้การสูญหาย หรือหนี้สินใดๆที่จะเกิดจากการดำเนินธุรกิจของสมาชิกหรือฝ่าฝืนตามข้อตกลงในสัญญา",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "10.สมาชิกจะต้องไม่รวบรวม ซื้อ หรือกระทำการด้วยประการใดๆ เพื่อให้ได้มาซึ่งสำเนาบัตรประชาชนของบุคคลอื่น แล้วนำมา ประกอบการสมัครเป็นสมาชิกของบริษัทฯ",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "11.กรอกข้อความและลงชื่อปลอมในบริษัทฯโดยเจ้าของสำเนาบัตรประชาชนไม่ได้รู้เห็น ยินยอมด้วย",
          style: TextStyle(fontSize: 16),
        ),
        const SizedBox(
          height: 10,
        ),
        Text(
          "4.การปฏิบัติตนของสมาชิกบริษัทฯ การใช้สปอนเซอร์",
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
        const SizedBox(
          height: 10,
        ),
        Text(
          "โดยบริษัทฯ มีนโยบายให้การสนับสนุนสิทธิในการสปอนเซอร์ แนะนำบุคคลทั่วไปร่วมเป็นสมาชิก ซึ่งในบางโอกาสสมาชิกอาจจะ พยายามที่จะเชิญผู้มุ่งหวังคนเดียวกัน ตามระเบียบแล้วสมาชิก คนแรกเท่านั้นมีสิทธิให้คำแนะนำในการขายและให้ความช่วย เหลือแก่บุคคลที่คาดว่าจะเป็นสมาชิกไม่ว่าบุคคลผู้นั้นจะสมัครเป็น สมาชิกโดยยื่นใบสมัครกี่ฉบับก็ตาม ชื่อของผู้เป็นสปอนเซอร์จะ ต้องเป็นชื่อของผู้ที่เชิญคนแรกเท่านั้น และถ้าหากมีการขัดแย้ง ด้านสิทธิในเรื่องดังกล่าว บริษัทฯจะถือสิทธิเป็นผู้พิจารณาตัดสิน แต่เพียงผู้เดียว",
          style: TextStyle(fontSize: 16),
        ),
        const SizedBox(
          height: 10,
        ),
        Text(
          "การซื้อและการจำหน่ายผลิตภัณฑ์",
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
        Text(
          "1.สมาชิกสามารถซื้อผลิตภัณฑ์จากบริษัทฯ ในราคาสมาชิก",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "2.ห้ามขายตัดราคาหรือลดราคา เพราะนอกจากจะทำให้ผลตอบแทนของตัวแทนสมาชิกลดลงแล้วยังส่งผลต่อการดำเนิน ธุรกิจของสมาชิกคนอื่นๆด้วย",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "3.ห้ามขายเกินกว่าราคาขายปลีกที่ระบุข้างกล่องของผลิตภัณฑ์ เนื่องจากจะส่งผลเสียต่อผลิตภัณฑ์ในด้านมาตรฐานการควบคุม ราคาผลิตภัณฑ์ของ บริษัทฯ",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "4.สมาชิกจะต้องไม่พยายามจำหน่ายหรือจำหน่ายผลิตภัณฑ์ของ บริษัทอื่นให้กับ สมาชิกในสายงานของตนเองและสมาชิก สายงานอื่นทั้งนี้รวมถึงการเป็นสปอนเซอร์ให้ทำธุรกิจกับ บริษัทอื่น ไม่ว่าจะทางตรงหรือทางอ้อม",
          style: TextStyle(fontSize: 16),
        ),
        const SizedBox(height: 10),
        Text(
          "การรับผลประโยชน์จากการดำเนินธุรกิจ",
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
        // const SizedBox(height:10),
        Text(
          "สมาชิกสามารถรับผลประโยชน์จากการดำเนินธุรกิจตามแผนการตลาดของบริษัทฯ ที่กำหนดไว้ตามเงื่อนไขทุกประการ เว้นแต่สมาชิกที่มี การทำผิดกฎระเบียบและข้อบังคับ ต้องขึ้นอยู่ในดุลพินิจของบริษัทฯ สิทธิประโยชน์ของการเป็นสมาชิก ดังนี้",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "1.สมาชิกจะได้รับผลกำไรจากการขายสินค้า",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "2.สมาชิกจะได้รับโบนัสตอบแทนจากแผนการตลาดที่บริษัทฯ กำหนดไว้ ทั้งนี้สมาชิกต้องติดต่อขอรับโบนัสผลตอบแทนจาก การดำเนินธุรกิจอย่างช้าที่ สุดไม่เกิน 180 วัน นับจากวันที่มีโบนัส ผลตอบแทนเกิดขึ้น หากเกินกำหนดให้เป็นดุลพินิจของบริษัทฯ",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "3.สมาชิกมีสิทธิเข้าร่วมโปรแกรมส่งเสริมการขายละโปรแกรม ฝึกอบรมที่บริษัทฯ จัดขึ้น",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "4.สมาชิกสามารถให้การรับรอง สนับสนุนบุคคลใดๆ ที่มีความประสงค์จะเข้าร่วมในระบบธุรกิจการโฆษณาส่งเสริมการขายผลิตภัณฑ์",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "5.โบชัวร์ แผ่นปลิว เอกสารสิ่งพิมพ์ รวมถึงนามบัตร สมาชิกอาจสร้างโฆษณาของตนเองได้ แต่ต้องมีเนื้อหาที่ถูกต้อง เป็นความจริง และต้องสอดคล้องกับกฎระเบียบปฏิบัติว่า ด้วยการโฆษณา ทั้งนี้ต้องผ่านการพิจารณาเห็นชอบและอนุมัติ จากทางบริษัทฯก่อนทุกครั้งจึงจะ สามารถนำไปเผยแพร่ได้",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "6.สมาชิกจัดโบชัวร์หรือเอ่ยชื่อผลิตภัณฑ์ เครื่องหมายการค้า หรือชื่อการค้าใน วีดีโอ ซีดี เว็บไซต์ หรือเทปบันทึกเสียงที่จัดทำขึ้น โดยในนามหรือคำสั่งของสมาชิกเองไม่ได้ ยกเว้นในกรณีที่ได้รับ การอนุญาตจากบริษัทฯ เท่านั้น",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "7.ในกรณีที่สมาชิกต้องการโฆษณากระจายเสียงทางวิทยุ และ/หรือเผยแพร่ทางสถานีโทรทัศน์ โดยต้องเอ่ยชื่อผลิตภัณฑ์ เครื่องหมายการค้าหรือชื่อการค้า ต้องได้รับอนุญาตจาก ทางบริษัทฯ ก่อนเท่านั้น",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "8.ในกรณีที่สมาชิกได้รับการติดต่อจากผู้สื่อข่าวเพื่อขอสัมภาษณ์ หรือให้คำแถลง สมาชิกต้องแนะนำให้ผู้สื่อข่าวติดต่อกับ ทางบริษัทฯ โดยตรงและต้องได้รับอนุมัติจากบริษัทฯก่อน จึงสามารถแถลงหรือให้สัมภาษณ์ต่อสื่อได้",
          style: TextStyle(fontSize: 16),
        ),
        const SizedBox(height: 10),
        Text(
          "ฉลากผลิตภัณฑ์และเอกสารวัสดุต่างๆ",
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
        Text(
          "1.สมาชิกจะฉีกออก ขีดฆ่า แก้ไข เพิ่มเติม หรือดัดแปลงฉลาก เอกสารหรือบรรณจุภัณฑ์ที่จัดทำขึ้นโดยบริษัทฯ ไม่ได้ แต่ถ้าพบ ข้อผิดพลาดให้รีบแจ้งบริษัทฯเพื่อดำเนินการแก้ไขให้ถูกต้องทันที",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "2.บริษัทฯ ขอสงวนสิทธิในการที่เปลี่ยนแปลงราคาของผลิตภัณฑ์ รวมทั้งข้อมูล รูปแบบของคู่มือการดำเนินธุรกิจโดยไม่ต้องจำเป็น ต้องแจ้งให้สมาชิกทราบล่วงหน้า",
          style: TextStyle(fontSize: 16),
        ),
        const SizedBox(
          height: 10,
        ),
        Text(
          "5.ความคุ้มครอบและมาตรฐานการลงโทษเกี่ยวกับการทำสายงาน",
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
        const SizedBox(
          height: 10,
        ),
        Text(
          "1.การทำสถานภาพซ้อน หากบริษัทฯ ตรวจสอบพบว่า สมาชิกคนใด มีสังกัดภายใต้สายงานหนึ่งอยู่แล้วไปดำเนินธุรกิจกับสายงานอื่น โดยใช้ชื่ออีกบุคคลหนึ่ง บริษัทฯจะกระทำการระงับการจ่าย ผลประโยชน์ต่างๆ ที่เกิดขึ้นภายใต้สายงานนั้น และยกเลิกการเป็น สมาชิกภายใต้สายงานนั้นทันที",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "2.การถอนสถานภาพการเป็นสมาชิกสังกัดสายงานเดิมเพื่อไป สังกัดสายงานใหม่ บริษัทฯ ไม่อนุญาตให้มีการเปลี่ยนย้าย สายงาน เพราะจะทำให้เกิดผลกระทบต่อประโยชน์ทางธุรกิจ ของสมาชิกคนอื่นๆ",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "3. การชักชวนให้ผู้อื่นเปลี่ยนสายงาน ในกรณีที่มีการเรียกร้องถึง พฤติกรรมอันไม่เหมาะสมที่ส่อถึงการทุจริตซึ่งมี หลักฐานชัดเจน หากบริษัทฯตรวจสอบแล้วพบว่ามีการทำผิดจริงตามเรียกร้อง บริษัทฯ จะดำเนินการย้ายคืนสายงานและผลประโยชน์ทั้งหมด ที่เกิดขึ้นนับจากวันที่มีการ ลงรหัสที่ตรวจพบว่ามีการแนะนำข้าม สายงานให้กับผู้แนะนำโดยชอบธรรมในสายงานเดิม",
          style: TextStyle(fontSize: 16),
        ),
        const SizedBox(
          height: 10,
        ),
        Text(
          "6.การโอนสิทธิการเป็นสมาชิก",
          style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
        ),
        const SizedBox(
          height: 10,
        ),
        Text(
          "1.ผู้รับโอนสิทธิต้องมีคุณสมบัติครบถ้วนตามเงื่อนไขของการเป็น สมาชิกใหม่ทุกประการ",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "2.ทุกครั้งที่มีการโอนสถานภาพสมาชิก ต้องได้รับการอนุมัติเป็นลายลักษณ์อักษรจากทางบริษัทฯก่อน ทั้งนี้ขึ้นอยู่กับดุลพินิจ ",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "2.ทุกครั้งที่มีการโอนสถานภาพสมาชิก ต้องได้รับการอนุมัติเป็นลายลักษณ์อักษรจากทางบริษัทฯก่อน ทั้งนี้ขึ้นอยู่กับดุลพินิจของบริษัทฯ ว่าจะอนุมัติให้มีการโอนสิทธิได้หรือไม่",
          style: TextStyle(fontSize: 16),
        ),
        Text(
          "3.ในการโอนสิทธิ ผู้รับโอนสิทธิจะต้องดำรงสถานภาพอยู่ในตำแหน่ง เดิมของสมาชิกผู้โอนสิทธิให้ทุกประการ",
          style: TextStyle(fontSize: 16),
        ),
        const SizedBox(height: 20),
        OutlinedButton(
            style: ElevatedButton.styleFrom(
                minimumSize: const Size(200, 50), primary: Colors.orange),
            onPressed: () {
              _submit(context);
            },
            child: Text(
              "รับทราบ".toUpperCase(),
              style: const TextStyle(
                  fontWeight: FontWeight.bold, color: Colors.white),
            ))
      ],
    );
  }

  void _submit(BuildContext context) {
    Navigator.of(context)
        .push(MaterialPageRoute(builder: (context) => submitScreen()));
  }
}
